anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/boot_rom/f28002x/rev0/rom_sources/F28002x_ROM/driverlib/dcc.h
    HWREGH(base + DCC_O_GCTRL2) =
   (HWREGH(base + DCC_O_GCTRL2) & ~(DCC_GCTRL2_CONT_ON_ERR_M)) |
   (DCC_ENABLE_VALUE << DCC_GCTRL2_CONT_ON_ERR_S);

    EDIS;
}

//*****************************************************************************
//
//! Stop DCC counting on Error
//!
//! \param base is the DCC module base address
//!
//! This function stops the DCC from counting to the next window of
//! comparison when an error condition occurs.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_stopOnError(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Stop counting on Error .
    //
    EALLOW;

    HWREGH(base + DCC_O_GCTRL2) =
   (HWREGH(base + DCC_O_GCTRL2) & ~(DCC_GCTRL2_CONT_ON_ERR_M)) |
   (DCC_DISABLE_VALUE << DCC_GCTRL2_CONT_ON_ERR_S);

    EDIS;
}

//*****************************************************************************
//
//! Enable DCC FIFO output read
//!
//! \param base is the DCC module base address
//!
//! This function enables the counter read registers to reflect FIFO
//! output instead of live counter value.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_enableFIFORead(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Enable the FIFO Read.
    //
    EALLOW;

    HWREGH(base + DCC_O_GCTRL2) =
   (HWREGH(base + DCC_O_GCTRL2) & ~(DCC_GCTRL2_FIFO_READ_M)) |
   (DCC_ENABLE_VALUE << DCC_GCTRL2_FIFO_READ_S);

     EDIS;
}

//*****************************************************************************
//
//! Disable DCC FIFO output read
//!
//! \param base is the DCC module base address
//!
//! This function disables the counter read registers to reflect FIFO
//! output instead of live counter value.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_disableFIFORead(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Disable the FIFO Read.
    //
    EALLOW;

    HWREGH(base + DCC_O_GCTRL2) =
   (HWREGH(base + DCC_O_GCTRL2) & ~(DCC_GCTRL2_FIFO_READ_M)) |
   (DCC_DISABLE_VALUE << DCC_GCTRL2_FIFO_READ_S);

    EDIS;
}

//*****************************************************************************
//
//! Enable DCC FIFO update regardless of any Error
//!
//! \param base is the DCC module base address
//!
//! This function enables FIFO writes regardless of an error event
//! on completion of comparison window.
//!
//! \note This is applicable only in Continuous mode ,in single shot
//! mode FIFO captures counts only on Error.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_enableFIFOUpdateOnNonError(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));


    //
    // Enable the FIFO update.
    //
    EALLOW;

    HWREGH(base + DCC_O_GCTRL2) =
   (HWREGH(base + DCC_O_GCTRL2) & ~(DCC_GCTRL2_FIFO_NONERR_M)) |
   (DCC_ENABLE_VALUE << DCC_GCTRL2_FIFO_NONERR_S);

     EDIS;
}

//*****************************************************************************
//
//! Disable DCC FIFO update only on Error
//!
//! \param base is the DCC module base address
//!
//! This function disables FIFO writes done regardless of an error event and
//! only allows writes on an error event.
//!
//! \note This is applicable only in Continuous mode ,in single shot
//! mode FIFO captures counts only on Error.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_disableFIFOUpdateOnNonError(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Disable the FIFO update.
    //
    EALLOW;

    HWREGH(base + DCC_O_GCTRL2) =
   (HWREGH(base + DCC_O_GCTRL2) & ~(DCC_GCTRL2_FIFO_NONERR_M)) |
   (DCC_DISABLE_VALUE << DCC_GCTRL2_FIFO_NONERR_S);

    EDIS;
}

//*****************************************************************************
//
//! Gets the status of the DCC FIFOs
//!
//! \param base is the DCC module base address
//! \param type is the FIFO whose status is needed.
//!
//! The function indicates whether the FIFOs are Full/Empty.
//!
//! The \e type parameter can have one of three values:
//! - \b DCC_FIFO_COUNT0 - Indicate whether Count0 FIFO is Full/Empty.
//! - \b DCC_FIFO_COUNT1  - Indicate whether Count1 FIFO is Full/Empty.
//! - \b DCC_FIFO_VALID0  - Indicate whether Valid0 FIFO is Full/Empty.
//! - \b DCC_FIFO_ALL - Indicate whether any FIFO is Full/Empty.
//!
//! \return status of the specific DCC FIFO.
//
//*****************************************************************************

static inline uint16_t
DCC_getFIFOStatus(uint32_t base, DCC_Fifo type)
{
   uint16_t status;

   //
   // Check the arguments.
   //
   ASSERT(DCC_isBaseValid(base));

   //
   // Get specified DCC FIFOs status
   //
   if(type == DCC_FIFO_COUNT0)
    {
     status = (HWREGH(base + DCC_O_STATUS2) & (DCC_STATUS2_COUNT0_FIFO_EMPTY |
                                               DCC_STATUS2_COUNT0_FIFO_FULL));
    }
   else if(type == DCC_FIFO_COUNT1)
    {
     status = (HWREGH(base + DCC_O_STATUS2) & (DCC_STATUS2_COUNT1_FIFO_EMPTY |
                                               DCC_STATUS2_COUNT1_FIFO_FULL));
    }
   else if(type == DCC_FIFO_VALID0)
    {
     status = (HWREGH(base + DCC_O_STATUS2) & (DCC_STATUS2_VALID0_FIFO_EMPTY |
                                               DCC_STATUS2_VALID0_FIFO_FULL));
    }
   else
    {
     status = (HWREGH(base + DCC_O_STATUS2) & (DCC_STATUS2_FIFO_EMPTY |
                                               DCC_STATUS2_FIFO_FULL));
    }

   return(status);
}

//*****************************************************************************
//
//! Get number of errors until DCC terminal count.
//!
//! \param base is the DCC module base address
//!
//! This function counts the number of errors either since the last
//! write/clear to this register or till terminal count is reached.
//!
//! \note Once terminal count is reached,the count freezes.
//!  User needs to clear it.
//!
//! \return Returns the error count until DCC terminal count is reached
//
//*****************************************************************************
static inline uint16_t
DCC_getErrorCount(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Get the number of errors until DCC terminal count
    //
    return(HWREGH(base + DCC_O_ERRCNT));
}

//*****************************************************************************
//
//! Clear Error Count
//!
//! \param base is the DCC module base address
//!
//! This function clears the error counts.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_clearErrorCount(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));


    EALLOW;

